import Foundation
import UIKit
import MapKit

struct Parks {
    let name: String
    let about: String
    let latitude: Double
    let longitude: Double
    let image: UIImage
    let adress: String
}

class ParkLocation  {
    static let shared = ParkLocation()
    
    var parks = [
        Parks(name: "Парк Нивки", about: "Парк ділиться на 2 частини: західну і східну. Умовним роздільником є залізничне полотно і річка Сирець, точніше те, що від неї залишилося. Східна частина парку віднесена до загальнодержавних природно заповідних територій, як парк-пам'ятка садово-паркового мистецтва. У парку налічується понад 90 видів вікових дерев.", latitude: 50.46258565, longitude: 30.42255878, image: #imageLiteral(resourceName: "nuvku"), adress: "Проспект Перемоги, 82Б"),
        Parks(name: "Парк КПІ", about: "Комплекс споруд Київського політехнічного інституту було збудовано впродовж 1898-1902 рр. 1903 року перед ними було закладено парк, у якому висаджувалися цінні породи дерев. Парк було закладено у природньому стилі, лише перед корпусами КПІ було створено регулярний тип парку.", latitude: 50.45127418, longitude: 30.4581356, image: #imageLiteral(resourceName: "kpi"), adress: "Проспект Перемоги, 37"),
        Parks(name: "Парк Пушкина", about: "Парк в Шевченківському районі міста Києва, в місцевості Шулявка. Розташований між проспектом Перемоги, кіностудією ім. О. Довженка та промисловою зоною по вулиці Дегтярівській.", latitude: 50.45662971, longitude: 30.45478821, image: #imageLiteral(resourceName: "pushkin"), adress: "Проспект Перемоги, 38"),
        Parks(name: "Парк імені Тараса Шевченка", about: "Парк імені Тараса Григоровича Шевченка (англ. Shevchenko Park in Kyiv) знаходиться в центральній частині Шевченківського району міста Києва і має статус «Парк-пам'ятник садово-паркового мистецтва місцевого значення». Розташований поблизу головного «червоного» корпусу Київського національного університету ім. Т.Г. Шевченко. У парку стоїть один із символів української столиці - пам'ятник на честь великого поета і культурного діяча Тараса Шевченка.", latitude: 50.44170923, longitude: 30.51323891, image: #imageLiteral(resourceName: "shevchenko"), adress: "Вулиця терещенківська, 24"),
        Parks(name: "Маіїнський парк", about: "У парку є оглядовий майданчик, цю площадку побудували ще при імператриці Марії в 1874 році: вид площі біля резиденції здавався Марії Олександрівні занадто похмурим, і вона розпорядилася побудувати в парку оглядовий майданчик. Тепер вдячні нащадки можуть насолодитися краєвидами Дніпра, київських пагорбів лівого берега столиці, а також Верховної Ради і стадіону Динамо.", latitude: 50.44640996, longitude: 30.54113388, image: #imageLiteral(resourceName: "mariinski"), adress: "Вулиця Михайла Грушевського, 1"),
        Parks(name: "Русанівська набережна", about: "Протяжність Русанівській набережній складає 1500 метрів. Прогулюючись по набережній ви зможете побачити: скульптуру «Бабка з кравчучкой», будівля Русанівській насосної станції, кілька дитячих майданчиків, скульптуру «Пташка на кубику»,  ротонду (в якій в теплу пору року у вихідні іноді грає оркестр), скульптуру «Драбина».", latitude: 50.4416819, longitude: 30.5898428, image: #imageLiteral(resourceName: "rusanovka"), adress: "Русанівська набережна, 1-10"),
        Parks(name: "Пейзажна алея", about: "Зона відпочинку в Києві, створена на місці зірвати оборонних валів Верхнього міста, які йшли зверху яром, над урочищем Гончарі. Фактично це доріжка (автомобільно-пішохідна), яка повторює трасу валу і об'єкти ландшафтного дизайну навколо (бордюри, паркова скульптура, дитячі майданчики, клумби). Бере початок від оглядового майданчика біля Національного музею історії України і завершується між будинками № 36 і 40 по вулиці Великій Житомирській. Алея була прокладена на початку 1980-х років за проектом архітектора Авраама Мілецького.", latitude: 50.45648626, longitude: 30.51566362, image: #imageLiteral(resourceName: "peyzazhnaya_alleya"), adress: "Пейзажна алея"),
        Parks(name: "Оболонська набережна", about: "Набережна на Оболоні є одним з найкрасивіших місць Києва в будь-який час року і має набагато більшу протяжність, ніж Русанівська набережна. Тут завжди приємно прогулятися одному, з друзями або близькою людиною, а вечорами тут іноді людей буває навіть більше, ніж на Хрещатику.", latitude: 50.5127481, longitude: 30.5139098, image: #imageLiteral(resourceName: "obolon"), adress: "Вулиця Оболонська Набережна"),
        Parks(name: "Національний природний парк 'Голосіївський'", about: """
В межах території парку, розташовані: Національний університет біоресурсів і природокористування України, Ботанічний сад Національного університету біоресурсів і природокористування України, Голосіївська пустинь, Національний експоцентр України, Клінічна лікарня "Феофанія", Інститут бджільництва ім. П. І. Прокоповича, Національний музей бджільництва України, Головна астрономічна обсерваторія НАН України, Національний музей народної архітектури та побуту України, Всеукраїнський центр радіохірургії.
Північна частина парку включає урочища з переважанням широколистяних лісів, таких як Голосіївський ліс (разом з прилеглим до нього Голосіївським парком ім. Максима Рильського), урочищами Теремки і Бичок. Південна частина парку — це піщана надзаплавна тераса Дніпра, вкрита сосновими лісами. Ця тераса перетинається річкою Сіверкою, яка розгалужена на кілька рукавів. У її долині знаходиться значний масив вільхових лісів.
""", latitude: 50.3905723, longitude: 30.50765991, image: #imageLiteral(resourceName: "goloseevskyu"), adress: "Вулиця Генерала Родимцева, 6а"),
        Parks(name: "Парк Відрадний", about: "Міський парк, розташований у Солом'янському районі міста Києва, між вулицями Михайла Донця, Героїв Севастополя та проспектом Комарова.", latitude: 50.4324811, longitude: 30.428273, image: #imageLiteral(resourceName: "vidrad"), adress: "Вулиця Михайла Донця, 13"),
    ]
    
    func parkLocation() -> [Parks] {
        return parks
    }
    
}
